comsys/traceroute.html
---
layout: page
title: Traceroute
---

<p>
<code>traceroute</code> belegt das <i>time to live</i> (TTL) Feld des IP-Headers mit
Werten zwischen 1 und 30 (Maximalwert der Standardeinstellung). Für
jeden TTL-Wert sendet <code>traceroute</code> in der Standardeinstellung 3 Pakete
(UDP oder ICMP) an die angegebene Zieladresse. Die TTL gibt an
wieviele Transitsysteme (hops) ein Paket auf dem Weg zum Zielsystem
passieren darf. Bei jedem hop wird der TTL-Wert um 1 dekrementiert.
Jedes System, welches ein IP-Paket mit TTL 0 empfängt verwirft das
Paket und sendet als Antwort ein <code>ICMP TIME EXCEEDED</code> Paket mit seiner
eigenen IP Adresse an das Quellsystem zurück. Erreicht ein Paket das
Zielsystem, so sendet dieses ein <code>ICMP DESTINATION UNREACHABLE</code> (PORT
UNREACHABLE Paket an das Quellsystem zurück. Empfängt traceroute ein
solches Paket von Zielsystem, so werden keine weiteren probes
geschickt. Auf Basis der IP-Adressen in den von Quellsystem
empfangenen UDP/ICMP Pakete kann somit die Route der Pakete nachvollzogen
werden.
</p>

<p>
Man unterscheidet
</p>

<ul class="org-ul">
<li>UDP basiertes traceroute (dabei wird ein Ziel-Port verwendet, der
mit hoher Wahrscheinlichkeit nicht verwendet wird)
</li>
<li>ICMP basiertes traceroute (ICMP-basiertes Traceroute kann mit
<code>traceroute --icmp</code> ausgeführt werden)
</li>
</ul>
